//
// NGPCarMenu. Custom plugin to improve the "Select Car" menu in stock RBR game menus (ie. for those not using external launchers).
//
// This plugin supports following features
// - Longer car menu names (up to 30 chars)
// - Shows the actual car specs information from NGP plugin instead of showing the old default car specs (which are not valid with NGP physics and car models)
// - Shows more information about installed 3D car models and authors (3D car model creators definitely deserve more attention).
// - Shows a custom car preview image to show the actual 3D model of custom car model (instead of showing the default car garage image)
// - Generates new car preview images from the currently installed 3D car models
// - Customized car and camera position to take automatic screenshots of 3D car models
//
// Copyright 2020, MIKA-N. https://github.com/mika-n
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this softwareand associated
// documentation files(the "Software"), to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense, and to permit persons to whom the Software
// is furnished to do so, subject to the following conditions :
// 
// - The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
// - The derived work or derived parts are also "open sourced" and the source code or part of the work using components
//   from this project is made publicly available with modifications to this base work.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO
// THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.IN NO EVENT SHALL THE AUTHORS
// OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
// OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//

#ifndef __NGPCARMENU_H_INCLUDED
#define __NGPCARMENU_H_INCLUDED

//#define WIN32_LEAN_AND_MEAN			// Exclude rarely-used stuff from Windows headers
//#include <windows.h>
//#include <assert.h>
//#include <stdio.h>
#include <d3d9.h>
#include <memory>					// unique_ptr and smart_ptr
//#include <forward_list>				// std::forward_list
#include <list>

#include "PluginHelpers.h"

#include "SimpleINI\SimpleIni.h"    // INI file handling (uses https://github.com/brofield/simpleini library)
#include "Detourxs\detourxs.h"		// Detour API handling (uses https://github.com/DominicTobias/detourxs library)

#include "D3D9Helpers.h"			// Various text and D3D9 support functions created for this RBR plugin
#include "RBRAPI.h"					// RBR memory addresses and data structures


#define C_PLUGIN_TITLE_FORMATSTR "NGPCarMenu Plugin (%s) by MIKA-N"	// %s is replaced with version tag strign. Remember to tweak it in NGPCarMenu.rc when making a new release
#define C_PLUGIN_FOOTER_STR      "https://github.com/mika-n/NGPCarMenu"

#define C_DEBUGTEXT_COLOR   D3DCOLOR_ARGB(255, 255,255,255)      // White

#define C_CARSPECTEXT_COLOR			D3DCOLOR_ARGB(255, 0xE0,0xE0,0xE0)   // Grey-White
#define C_CARMODELTITLETEXT_COLOR	D3DCOLOR_ARGB(255, 0x7F,0x7F,0xFE)   // Light-blue

#define C_REPLAYFILENAME_SCREENSHOT   "_NGPCarMenu.rpl"  // Name of the temporary RBR replay file (char and wchar version)
#define C_REPLAYFILENAME_SCREENSHOTW L"_NGPCarMenu.rpl"

#define C_RBRTM_PLUGIN_NAME     "RBR Tournament"
#define C_MAX_RECENT_RBRTM_MAPS 5

//
// The state of the plugin enum
//
enum class T_PLUGINSTATE
{
	PLUGINSTATE_UNINITIALIZED = 0,
	PLUGINSTATE_INITIALIZING = 1,
	PLUGINSTATE_INITIALIZED = 2,
	PLUGINSTATE_CLOSING = 3
};


//------------------------------------------------------------------------------------------------

#define MAX_CARMENUNAME_NORMALCHARS 28
#define MAX_CARMENUNAME_ALLCHARS    31

typedef struct {
	UINT_PTR ptrCarMenuName;		// RBR memory location of a car menu name string ptr (char pointer in RBR memory space) (car menu order#) (SSE executable)
	UINT_PTR ptrCarDescription;		// RBR memory location of a car description string ptr

	char szCarMenuName[MAX_CARMENUNAME_ALLCHARS + 1]; // Max "normal width" chars to show is 27+null. But if the text has many I or 1 letters then two of those gives one extra char (max still 31+null);

	WCHAR wszCarModel[64];			// carList.ini.Name   (WCHAR, rbr TechnicalSpec line)
	CHAR  szCarCategory[32];		// carList.ini.Cat    (CHAR, model pointer text)
	WCHAR wszCarPower[32];			// carList.ini.Power  (WCHAR, Horsepower)
	WCHAR wszCarYear[8];			// carList.ini.Year   (WCHAR, Torque)
	WCHAR wszCarWeight[8];			// carList.ini.Weight (WCHAR, Weight, position-Y moved to the original engine position-Y location)
	WCHAR wszCarTrans[32];			// physics/common.lsp.NumberOfGears, carList.ini.Trans 4WD (WCHAR, Transmission, position-Y of transmission spec item moved to TYRES title position-Y)
									// (rbr Engine and Tyre title and text txt slot empty/not used. Position-Y moved to -XXX to hide those entries)

	WCHAR wszCarPhysicsRevision[128];  // physics/CARNAME Revision: 02 / 2019-06-03 (Written below car spec data using a bit smaller font size)
	WCHAR wszCarPhysicsSpecYear[128];  // Specification date:
	WCHAR wszCarPhysics3DModel[128];   // 3D model:
	WCHAR wszCarPhysicsLivery[128];    // Livery (Liver and Livery credits)
	WCHAR wszCarPhysicsCustomTxt[128]; // If physics/CARNAME file has a 5th text line, otherwise blank text. The 5th line in car model file can be used to show any custom text

	WCHAR wszCarFMODBank[128];		   // Custom FMOD sound bank
} RBRCarSelectionMenuEntry;
typedef RBRCarSelectionMenuEntry* PRBRCarSelectionMenuEntry;

//------------------------------------------------------------------------------------------------

#define RBRTMMENUIDX_CARSELECTION		0x15978614	// RBRTMMenuObj.menuID values. RBRTM car selection screen (either below Shakedown or OnlineTournament menu tree)
#define RBRTMMENUIDX_MAIN				0x159785F8  // RBRTM main menu, so the RBRTM menu is no longer below Shakedown or OnlineTournament menu tree
#define RBRTMMENUIDX_ONLINEOPTION1		0x159786F8	// RBRTM OnlineTournament options 1 menu (options for online rally lookups)
#define RBRTMMENUIDX_ONLINEOPTION2		0x15978684	// RBRTM OnlineTournament options 2 menu (list of online rallies)
#define RBRTMMENUIDX_SHAKEDOWNSTAGES	0x15978154	// RBRTM Shakedown Stage selection screen
#define RBRTMMENUIDX_SHAKEDOWNOPTION1	0x159786A0	// RBRTM Shakedown options 1 menu (the menu just before the car selection screen)

typedef struct {
#pragma pack(push,1)
	BYTE unknown1;
	BYTE unknown2;
	BYTE serviceMins;    // 0 = Shakedown without service parks. >1 = Mins of the next service park
	BYTE selectedCarID;  // 00..07 = Selected car slot#
#pragma pack(pop)
} RBRTMStageOptions1;
typedef RBRTMStageOptions1* PRBRTMStageOptions1;

typedef struct {
#pragma pack(push,1)
	const WCHAR*  wszMenuItemName; // 0x00
	BYTE    pad1[0x2C - 0x00 - sizeof(WCHAR*)];
	__int32 mapID;			 // 0x2C
	BYTE    pad2[0x38 - 0x2C - sizeof(__int32)]; // 0x38 = Total size of RBRTM menu item struct
#pragma pack(pop)
} RBRTMMenuItem;
typedef RBRTMMenuItem* PRBRTMMenuItem;

typedef struct {
#pragma pack(push,1)
	__int32 unknown1;			// 0x00
	PRBRTMMenuItem pMenuItems;	// 0x04 Pointer to array of menuItem structs
	__int32 numOfItems;			// 0x08 Num of items in pMenuItems array (not including the "Back" menu item)
#pragma pack(pop)
} RBRTMMenuData;
typedef RBRTMMenuData* PRBRTMMenuData;

typedef struct {
#pragma pack(push,1)
	DWORD menuID;				// 0x00	(0x159785F8=RBRTM main menu, 0x15978614=RBRTM CarSelection screen, 0x159786F8=Online options1 screen, 0x15978684=Online options2 screen, 0x15978154=Shakedown stage selection, 0x159786A0=Shakedown options screen)
	PRBRTMMenuData pMenuData;	// 0X04
#pragma pack(pop)
} RBRTMMenuObj;
typedef RBRTMMenuObj* PRBRTMMenuObj;

// Offset 0x1597F128?
typedef struct {
#pragma pack(push,1)
	__int32 unknown1;				// 0x00
	__int32 unknown2;				// 0x04
	__int32 unknown3;				// 0x08
	PRBRTMMenuObj pCurrentRBRTMMenuObj;	// 0x0C - Pointer to the current RBRTM menu object
	__int32 selectedItemIdx;		// 0x10 - Currently selected menu item line
	__int32 selectedStage;			// 0x14 - Currently selected shakedown stage# (mapID). Set after the stage was selected from the list of RBRTM stages
	BYTE pad1[0xA08 - 0x14 - sizeof(__int32)];
	__int32 numOfMenuItems;			// 0xA08 - Num of menu rows + 1 (back) in Shakedown stage selection menu list. This controls the max movement of focus line (not the num of shown menu items). RBRTMMenuData.numOfItems controls the num of shown menu items, but not focus line movements.
	BYTE pad2[0xBA2 - 0xA08 - sizeof(__int32)];
	PRBRTMStageOptions1 pRBRTMStageOptions1;	// 0xBA2
#pragma pack(pop)
} RBRTMPlugin;
typedef RBRTMPlugin* PRBRTMPlugin;

struct RBRTM_MapInfo {
	int			  mapID;			// MapID
	int			  mapIDMenuIdx;		// Menu index (used when the previous menu line is automatically selected when user navigates back to Shakedown menu)
	std::wstring  name;
	double		  length;
	int			  surface;
	std::wstring  previewImageFile;
	IMAGE_TEXTURE imageTexture;

	RBRTM_MapInfo() 
	{
		name.reserve(64);
		mapID = -1;
		mapIDMenuIdx = -1;
		length = -1;
		surface = -1;
		ZeroMemory(&imageTexture, sizeof(IMAGE_TEXTURE));
	}

	~RBRTM_MapInfo()
	{
		SAFE_RELEASE(imageTexture.pTexture);
	}
};


//------------------------------------------------------------------------------------------------

typedef struct {
#pragma pack(push,1)
	char szTrackName[256];
	char szTrackFolder[260];
#pragma pack(pop)
} RBRRXMenuItem;
typedef RBRRXMenuItem* PRBRRXMenuItem;

typedef struct {
#pragma pack(push,1)
	BYTE pad[0x08];				// 0x00
	__int32 selectedItemIdx;	// 0x08
#pragma pack(pop)
} RBRRXMenuData;
typedef RBRRXMenuData* PRBRRXMenuData;

// Offset rbr_rx base
typedef struct {
#pragma pack(push,1)
	BYTE pad1[0x608E4];			// 0x00	
	PRBRRXMenuItem pMenuItems;	// 0x608E4
	__int32 numOfItems;			// 0x608E8
	BYTE pad2[0x60918- 0x608E8 - sizeof(__int32)];
	__int32 menuID;				// 0x60918			0=main, 1=stages, 2=replay
	BYTE pad3[0x665F4 - 0x60918- sizeof(__int32)];
	PRBRRXMenuData pMenuData;	// 0x665F4 
#pragma pack(pop)
} RBRRXPlugin;
typedef RBRRXPlugin* PRBRRXPlugin;

struct RBRRX_MapInfo {
	int			  mapIDMenuIdx;		// Menu index (used when the previous menu line is automatically selected when user navigates back to Shakedown menu)
	std::string   name;
	std::string   folderName;
	//double length;
	std::wstring  surface;
	std::wstring  previewImageFile;
	IMAGE_TEXTURE imageTexture;

	RBRRX_MapInfo()
	{
		//name.reserve(256);
		mapIDMenuIdx = -1;
		//length = -1;
		surface = L"";
		ZeroMemory(&imageTexture, sizeof(IMAGE_TEXTURE));
	}

	~RBRRX_MapInfo()
	{
		SAFE_RELEASE(imageTexture.pTexture);
	}
};


//------------------------------------------------------------------------------------------------

#define C_SCREENSHOTAPITYPE_DIRECTX 0
#define C_SCREENSHOTAPITYPE_GDI     1

class CNGPCarMenu;

extern BOOL         g_bRBRHooksInitialized;
extern CNGPCarMenu* g_pRBRPlugin;

extern HRESULT __fastcall CustomRBRDirectXBeginScene(void* objPointer);
