//
// NGPCarMenu. Custom plugin to improve the "Select Car" menu in stock RBR game menus (ie. for those not using external launchers).
//
// This plugin supports following features
// - Longer car menu names (up to 30 chars)
// - Shows the actual car specs information from NGP plugin instead of showing the old default car specs (which are not valid with NGP physics and car models)
// - Shows more information about installed 3D car models and authors (3D car model creators definitely deserve more attention).
// - Shows a custom car preview image to show the actual 3D model of custom car model (instead of showing the default car garage image)
// - Generates new car preview images from the currently installed 3D car models
// - Customized car and camera position to take automatic screenshots of 3D car models
//
// Copyright 2020, MIKA-N. https://github.com/mika-n
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this softwareand associated
// documentation files(the "Software"), to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense, and to permit persons to whom the Software
// is furnished to do so, subject to the following conditions :
// 
// - The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
// - The derived work or derived parts are also "open sourced" and the source code or part of the work using components
//   from this project is made publicly available with modifications to this base work.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO
// THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.IN NO EVENT SHALL THE AUTHORS
// OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
// OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//

#ifndef __NGPCARMENU_H_INCLUDED
#define __NGPCARMENU_H_INCLUDED

//#define WIN32_LEAN_AND_MEAN			// Exclude rarely-used stuff from Windows headers
//#include <windows.h>
//#include <assert.h>
//#include <stdio.h>
#include <d3d9.h>
#include <memory>					// unique_ptr and smart_ptr
//#include <forward_list>				// std::forward_list
#include <list>
#include <forward_list>
#include <deque>

#include "PluginHelpers.h"

#include "SimpleINI\SimpleIni.h"    // INI file handling (uses https://github.com/brofield/simpleini library)
#include "Detourxs\detourxs.h"		// Detour API handling (uses https://github.com/DominicTobias/detourxs library)

#include "D3D9Helpers.h"			// Various text and D3D9 support functions created for this RBR plugin
#include "RBRAPI.h"					// RBR memory addresses and data structures

#include "SQLite/CppSQLite3U.h"

#define C_PLUGIN_TITLE_FORMATSTR "NGPCarMenu Plugin (%s) by MIKA-N"	// %s is replaced with version tag strign. Remember to tweak it in NGPCarMenu.rc when making a new release
#define C_PLUGIN_FOOTER_STR      "https://github.com/mika-n/NGPCarMenu"

#define C_DEBUGTEXT_COLOR   D3DCOLOR_ARGB(255, 255,255,255)      // White

#define C_CARSPECTEXT_COLOR			D3DCOLOR_ARGB(255, 0xE0,0xE0,0xE0)   // Grey-White
#define C_CARMODELTITLETEXT_COLOR	D3DCOLOR_ARGB(255, 0x7F,0x7F,0xFE)   // Light-blue

#define C_DARKGREYBACKGROUND_COLOR  D3DCOLOR_ARGB(255, 0x3D, 0x3D, 0x3D) // Dark grey
#define C_LIGHTGREYBACKGROUND_COLOR D3DCOLOR_ARGB(255, 0x7E, 0x7E, 0x7E) // Light grey
#define C_REDSEPARATORLINE_COLOR    D3DCOLOR_ARGB(255, 0xB2, 0x2B, 0x2B) // Dark red

#define C_REPLAYFILENAME_SCREENSHOT   "_NGPCarMenu.rpl"  // Name of the temporary RBR replay file (char and wchar version)
#define C_REPLAYFILENAME_SCREENSHOTW L"_NGPCarMenu.rpl"

#define C_RBRTM_PLUGIN_NAME     "RBR Tournament"
#define C_MAX_RECENT_RBRTM_MAPS 5

//
// The state of the plugin enum
//
enum class T_PLUGINSTATE
{
	PLUGINSTATE_UNINITIALIZED = 0,
	PLUGINSTATE_INITIALIZING = 1,
	PLUGINSTATE_INITIALIZED = 2,
	PLUGINSTATE_CLOSING = 3
};


//------------------------------------------------------------------------------------------------

#define MAX_CARMENUNAME_NORMALCHARS 28
#define MAX_CARMENUNAME_ALLCHARS    31

typedef struct {
	UINT_PTR ptrCarMenuName;		// RBR memory location of a car menu name string ptr (char pointer in RBR memory space) (car menu order#) (SSE executable)
	UINT_PTR ptrCarDescription;		// RBR memory location of a car description string ptr

	char szCarMenuName[MAX_CARMENUNAME_ALLCHARS + 1]; // Max "normal width" chars to show is 27+null. But if the text has many I or 1 letters then two of those gives one extra char (max still 31+null);

	WCHAR wszCarModel[64];			// carList.ini.Name   (WCHAR, rbr TechnicalSpec line)
	WCHAR wszCarModelFolder[128];	// Folder of the car physics (rbrApp\Cars\carModelFolder\)

	CHAR  szCarCategory[32];		// carList.ini.Cat    (CHAR, model pointer text)
	WCHAR wszCarPower[32];			// carList.ini.Power  (WCHAR, Horsepower)
	WCHAR wszCarYear[8];			// carList.ini.Year   (WCHAR, Torque)
	WCHAR wszCarWeight[8];			// carList.ini.Weight (WCHAR, Weight, position-Y moved to the original engine position-Y location)
	WCHAR wszCarTrans[32];			// physics/common.lsp.NumberOfGears, carList.ini.Trans 4WD (WCHAR, Transmission, position-Y of transmission spec item moved to TYRES title position-Y)
									// (rbr Engine and Tyre title and text txt slot empty/not used. Position-Y moved to -XXX to hide those entries)

	WCHAR wszCarPhysicsRevision[128];  // physics/CARNAME Revision: 02 / 2019-06-03 (Written below car spec data using a bit smaller font size)
	WCHAR wszCarPhysicsSpecYear[128];  // Specification date:
	WCHAR wszCarPhysics3DModel[128];   // 3D model:
	WCHAR wszCarPhysicsLivery[128];    // Livery (Liver and Livery credits)
	WCHAR wszCarPhysicsCustomTxt[128]; // If physics/CARNAME file has a 5th text line, otherwise blank text. The 5th line in car model file can be used to show any custom text
	WCHAR wszCarPhysics[128];		   // Car physics name (NGP physics folder name)

	WCHAR wszCarFMODBank[128];		   // Custom FMOD sound bank
	WCHAR wszCarFMODBankAuthors[128];  // Custom FMOD sound bank

	WCHAR wszCarListSectionName[32];   // NGP carList.ini section name (Car_xxx or carID as string value if RSF installation)

} RBRCarSelectionMenuEntry;
typedef RBRCarSelectionMenuEntry* PRBRCarSelectionMenuEntry;

//------------------------------------------------------------------------------------------------

#define RBRTMMENUIDX_CARSELECTION		0x15978614	// RBRTMMenuObj.menuID values. RBRTM car selection screen (either below Shakedown or OnlineTournament menu tree)
#define RBRTMMENUIDX_MAIN				0x159785F8  // RBRTM main menu, so the RBRTM menu is no longer below Shakedown or OnlineTournament menu tree
#define RBRTMMENUIDX_ONLINEOPTION1		0x159786F8	// RBRTM OnlineTournament options 1 menu (options for online rally lookups)
#define RBRTMMENUIDX_ONLINEOPTION2		0x15978684	// RBRTM OnlineTournament options 2 menu (list of online rallies)
#define RBRTMMENUIDX_SHAKEDOWNSTAGES	0x15978154	// RBRTM Shakedown Stage selection screen
#define RBRTMMENUIDX_SHAKEDOWNOPTION1	0x159786A0	// RBRTM Shakedown options 1 menu (the menu just before the car selection screen)

typedef struct {
#pragma pack(push,1)
	BYTE unknown1;
	BYTE unknown2;
	BYTE serviceMins;    // 0 = Shakedown without service parks. >1 = Mins of the next service park
	BYTE selectedCarID;  // 00..07 = Selected car slot#
#pragma pack(pop)
} RBRTMStageOptions1;
typedef RBRTMStageOptions1* PRBRTMStageOptions1;

typedef struct {
#pragma pack(push,1)
	const WCHAR*  wszMenuItemName; // 0x00
	BYTE    pad1[0x2C - 0x00 - sizeof(WCHAR*)];
	__int32 mapID;			 // 0x2C
	BYTE    pad2[0x38 - 0x2C - sizeof(__int32)]; // 0x38 = Total size of RBRTM menu item struct
#pragma pack(pop)
} RBRTMMenuItem;
typedef RBRTMMenuItem* PRBRTMMenuItem;

typedef struct {
#pragma pack(push,1)
	__int32 unknown1;			// 0x00
	PRBRTMMenuItem pMenuItems;	// 0x04 Pointer to array of menuItem structs
	__int32 numOfItems;			// 0x08 Num of items in pMenuItems array (not including the "Back" menu item)
#pragma pack(pop)
} RBRTMMenuData;
typedef RBRTMMenuData* PRBRTMMenuData;

typedef struct {
#pragma pack(push,1)
	DWORD menuID;				// 0x00	(0x159785F8=RBRTM main menu, 0x15978614=RBRTM CarSelection screen, 0x159786F8=Online options1 screen, 0x15978684=Online options2 screen, 0x15978154=Shakedown stage selection, 0x159786A0=Shakedown options screen)
	PRBRTMMenuData pMenuData;	// 0X04
#pragma pack(pop)
} RBRTMMenuObj;
typedef RBRTMMenuObj* PRBRTMMenuObj;

// Offset 0x1597F128?
typedef struct {
#pragma pack(push,1)
	__int32 unknown1;				// 0x00
	__int32 activeStatus;			// 0x04   0=The loaded track is not RBRTM track, 1=RBRTM plugin active and the loaded track is RBRTM track
	__int32 unknown3;				// 0x08
	PRBRTMMenuObj pCurrentRBRTMMenuObj;	// 0x0C - Pointer to the current RBRTM menu object
	__int32 selectedItemIdx;		// 0x10 - Currently selected menu item line
	__int32 selectedStage;			// 0x14 - Currently selected shakedown stage# (mapID). Set after the stage was selected from the list of RBRTM stages
	BYTE pad1[0xA08 - 0x14 - sizeof(__int32)];
	__int32 numOfMenuItems;			// 0xA08 - Num of menu rows + 1 (back) in Shakedown stage selection menu list. This controls the max movement of focus line (not the num of shown menu items). RBRTMMenuData.numOfItems controls the num of shown menu items, but not focus line movements.
	BYTE pad2[0xBA2 - 0xA08 - sizeof(__int32)];
	PRBRTMStageOptions1 pRBRTMStageOptions1;	// 0xBA2
#pragma pack(pop)
} RBRTMPlugin;
typedef RBRTMPlugin* PRBRTMPlugin;

struct RBRTM_MapInfo {
	int			  mapID;			// MapID
	int			  mapIDMenuIdx;		// Menu index (used when the previous menu line is automatically selected when user navigates back to Shakedown menu)
	std::wstring  name;
	double		  length;
	int			  surface;

	std::wstring  previewImageFile;
	IMAGE_TEXTURE imageTexture;
	BOOL          shakedownOptionsFirstTimeSetup;  // Shakedown map selection shows a map preview. The shakedown options screen after the map selection shows also a map preview image. When this is TRUE then the option image is re-initialized.

	RBRTM_MapInfo() 
	{
		name.reserve(64);
		mapID = -1;
		mapIDMenuIdx = -1;
		length = -1;
		surface = -1;
		shakedownOptionsFirstTimeSetup = TRUE;
		ZeroMemory(&imageTexture, sizeof(IMAGE_TEXTURE));
	}

	~RBRTM_MapInfo()
	{
		SAFE_RELEASE(imageTexture.pTexture);
	}
};


//------------------------------------------------------------------------------------------------

typedef struct {
#pragma pack(push,1)
	char szTrackName[256];
	char szTrackFolder[256];
	__int32 physicsID;			// BTB physics 0=gravel, 1=tarmac, 2=snow (derived from track.ini physics option)
#pragma pack(pop)
} RBRRXMenuItem;
typedef RBRRXMenuItem* PRBRRXMenuItem;

typedef struct {
#pragma pack(push,1)
	BYTE pad[0x08];				// 0x00
	__int32 selectedItemIdx;	// 0x08
#pragma pack(pop)
} RBRRXMenuData;
typedef RBRRXMenuData* PRBRRXMenuData;

// Offset rbr_rx.dll base addr
typedef struct {
#pragma pack(push,1)
	BYTE pad1[0x52588];			// 0x00	
	__int32 menuFocusWidth;		// 0x52588  (width of the red focus line in RBRRX menus)
	BYTE pad2[0x52590 - 0x52588  - sizeof(__int32)];
	__int32 menuPosX;			// 0x52590	(X pos of RBRRX menus)

	BYTE pad21[0x608D0 - 0x52590 - sizeof(__int32)];

	BYTE loadTrackStatusD0;		// 0x608D0  (Set to 0x01 when loading a track, otherwise 0x00)
	BYTE pad3[0x608D4 - 0x608D0 - sizeof(BYTE)];
	__int32 unknown1;			// 0x608D4
	__int32 loadTrackStatusD8;	// 0x608D8  (Set to 0x01 when loading a track, otherwise 0x00)
	__int32 loadTrackID;		// 0x608DC (menuIdx to the currently loaded BTB track)

	BYTE pad31[0x608E4 - 0x608DC - sizeof(__int32)];
	PRBRRXMenuItem pMenuItems;	// 0x608E4
	__int32 numOfItems;			// 0x608E8

	BYTE pad4[0x60904 - 0x608E8 - sizeof(__int32)];

	LPDIRECT3DDEVICE9 pRBRRXIDirect3DDevice9; // 0x60904
	
	BYTE pad5[0x60914 - 0x60904 - sizeof(LPDIRECT3DDEVICE9)];

	__int32 keyCode;			// 0x60914  The keycode of the last pressed key (key down) (37=Left arrowkey, 39=Right arrowkey, 36=Home, 35=End)
	__int32 menuID;				// 0x60918  0=main, 1=stages, 2=replay
	BYTE pad6[0x609A0 - 0x60918 - sizeof(__int32)];

								// 0x60958  Ptr to struct of BTB track definition (file names to various INI files of the loaded BTB track)?

	__int32 currentPhysicsID;	// 0x609A0  The current physicsID while loading a BTB track (0..2)
	__int32 loadTrackStatusA4;  // 0x609A4  LoadTrack status (0x01 = Loading track, 0x00 = Not loading)
	BYTE pad7[0x66528 - 0x609A4 - sizeof(__int32)];

	WCHAR wszTrackName[60];		// 0x66528  The name of the last selected track (multibyteToWideChar converted)
	BYTE pad8[0x665F4 - 0x66528 - sizeof(WCHAR)*60];
	PRBRRXMenuData pMenuData;	// 0x665F4  Ptr to selectedItemIdx struct
#pragma pack(pop)
} RBRRXPlugin;
typedef RBRRXPlugin* PRBRRXPlugin;

struct RBRRX_MapInfo {
	int			  mapIDMenuIdx;		// Menu index (or -1 if this struct is not valid)
	std::string   folderName;		// BTB map data folder (this folder should have track.ini file)
	int			  physicsID;		// BTB physics 0=gravel, 1=tarmac, 2=snow (track.ini physics option)

	std::string   name;				// Track.ini metadata. name=
	std::wstring  surface;			//		physics=
	std::string   author;			//		author=
	std::string   version;			//		version=
	std::string   date;				//      date=
	std::string   comment;			//      comment=

	double length;					// The length of the stage set by track.ini length option or via BTB track data (split1-split2-finish distance in RBR data structure)
	int    numOfPacenotes;			// Num of pacenotes entries in pacenotes.ini file (usually <20 notes means that notes are not set)

	std::wstring  previewImageFile;
	IMAGE_TEXTURE imageTexture;
	IMAGE_TEXTURE imageTextureLoadTrack;
	BOOL          trackOptionsFirstTimeSetup;  // Map selection shows a map preview. The track options screen after the map selection shows also a map preview image. When this is TRUE then the option image is re-initialized.

	RBRRX_MapInfo()
	{
		mapIDMenuIdx = -1;
		length = -1;
		numOfPacenotes = 0;

		physicsID = 0;
		name.reserve(64);
		folderName.reserve(256);
		surface.reserve(16);
		previewImageFile.reserve(260);
		trackOptionsFirstTimeSetup = TRUE;

		ZeroMemory(&imageTexture, sizeof(IMAGE_TEXTURE));
		ZeroMemory(&imageTextureLoadTrack, sizeof(IMAGE_TEXTURE));
	}

	~RBRRX_MapInfo()
	{
		SAFE_RELEASE(imageTexture.pTexture);
		SAFE_RELEASE(imageTextureLoadTrack.pTexture);
	}

	void Clear()
	{
		length = -1;
		numOfPacenotes = 0;
		surface.clear();
		author.clear();
		version.clear();
		date.clear();
	}
};


//------------------------------------------------------------------------------------------------
// Minimap structs
//
typedef struct _POINT_DRIVELINE_float
{
	POINT_float	drivelineCoord;	// X,Y coordinate from the original driveline data
	float drivelineDistance;	// Distance (from the beginning of driveline data)

	bool operator<(const struct _POINT_DRIVELINE_float& b) const
	{
		return (drivelineDistance < b.drivelineDistance);
	}

	bool operator==(const struct _POINT_DRIVELINE_float& b) const
	{
		return (drivelineCoord == b.drivelineCoord && drivelineDistance == b.drivelineDistance);
	}
} POINT_DRIVELINE_float;

class CDrivelineSource
{
public:
	std::list<POINT_DRIVELINE_float> vectDrivelinePoint;	// Driveline data points x,y and distance
	POINT_float pointMin;	// Minimum and maximum x and y values in the driveline data (used to calculate the size and aspect ratio of the minimap graph)
	POINT_float pointMax;	//

	float startDistance;	// The distance of start line from the beginning of the driveline data (pacenote type21).
	float split1Distance;	//   split 1 (pacenote type23). Some BTB tracks don't have this split point.
	float split2Distance;	//   split 2 (pacenote type23). Some BTB tracks don't have this split point.
	float finishDistance;	// The distance of finish line from the beginning of the driveline data (pacenote type22)

	CDrivelineSource()
	{
		startDistance = split1Distance = split2Distance = finishDistance = -1;
		ZeroMemory(&pointMin, sizeof(POINT_float));
		ZeroMemory(&pointMax, sizeof(POINT_float));
	}
};


typedef struct _POINT_DRIVELINE_int
{
	POINT_int drivelineCoord;
	int splitType;				// 0 = Start->split1, 1 = Split1->Split2, 2=Split2->Finish

	bool operator<(const struct _POINT_DRIVELINE_int& b) const
	{
		return (drivelineCoord < b.drivelineCoord);
	}

	bool operator==(const struct _POINT_DRIVELINE_int& b) const
	{
		return (drivelineCoord == b.drivelineCoord && splitType == b.splitType);
	}
} POINT_DRIVELINE_int;

class CMinimapData
{
public:
	std::list<POINT_DRIVELINE_int> vectMinimapPoint;	// Scaled-down coordinates of the minimap (INT)
	RECT minimapRect;									// Scaled-down rectangle area
	POINT_int minimapSize;								// The actual width and height of the minimap

	std::string trackFolder;							// The name of the BTB track folder (cached minimap identifier if the map is for RBRRX/BTB)
	int mapID;											// MapID of the RBRTM track (cached minimap ID if the map is for RBRTM)

	CMinimapData()
	{
		mapID = -1;
		ZeroMemory(&minimapSize, sizeof(POINT_int));
		ZeroMemory(&minimapRect, sizeof(RECT));
	}
};


//------------------------------------------------------------------------------------------------

#define C_SCREENSHOTAPITYPE_DIRECTX 0
#define C_SCREENSHOTAPITYPE_GDI     1

class CNGPCarMenu;

extern BOOL         g_bRBRHooksInitialized;
extern CNGPCarMenu* g_pRBRPlugin;

extern HRESULT __fastcall CustomRBRDirectXBeginScene(void* objPointer);
extern HRESULT __fastcall CustomRBRDirectXEndScene(void* objPointer);

extern int     __fastcall CustomRBRReplay(void* objPointer, DWORD dummyEDX, const char* szReplayFileName, __int32* pUnknown1, __int32* pUnknown2, size_t iReplayFileSize);
extern int     __fastcall CustomRBRSaveReplay(void* objPointer, DWORD dummyEDX, const char* szReplayFileName, __int32 mapID, __int32 carID, __int32 unknown1);

extern float   __fastcall CustomRBRControllerAxisData(void* objPointer, DWORD dummyEDX, __int32 axisID);

extern RBRCarSelectionMenuEntry g_RBRCarSelectionMenuEntry[];

extern wchar_t* g_pOrigLoadReplayStatusText;
extern wchar_t  g_wszCustomLoadReplayStatusText[];


#if USE_DEBUG == 1
extern CD3DFont* g_pFontDebug;
#endif
extern CD3DFont* g_pFontCarSpecCustom;	// Custom car spec text font style
extern CD3DFont* g_pFontCarSpecModel;	// Custom model spec font style (author of car and map model, a bit smaller than SpecCustom font style)

extern CD3DFont* g_pFontRBRRXLoadTrack;	    // Custom RBRRX LoadingTrack font style
extern CD3DFont* g_pFontRBRRXLoadTrackSpec; //

extern PRBRPluginMenuSystem g_pRBRPluginMenuSystem;

extern std::vector<std::string>* g_pRBRRXTrackNameListAlreadyInitialized;

extern CppSQLite3DB* g_pRaceStatDB;


//------------------------------------------------------------------------------------------------//
// CRBRPluginIntegratorLink. Integrates the custom image drawing with a specified plugin.
// The linked "other plugin" doesn't have to worry about directX textures, vertex, surface and bitmap objects because this NGPCarMenu plugin takes care of those.
// DrawFrontEndPage method of the "other plugin" can use simple API functions exported by NGPCarMenu 
// plugin to load and draw custom images at specified location with or without scaling (PNG and BMP files).
// See src/SamplePluginIntegration/NGPCarMenuAPI.h header. Include NGPCarMenuAPI.h header file in your own plugin and use those CNGPCarMenuAPI class methods to register a plugin link and to draw custom images.
//
class CRBRPluginIntegratorLinkImage
{
public:
	int m_iImageID;
	std::string m_sImageFileName;
	bool  m_bShowImage;
	POINT m_imagePos;
	SIZE  m_imageSize;
	DWORD m_dwImageFlags;
	
	IMAGE_TEXTURE m_imageTexture;
	CMinimapData m_minimapData; // if imageFileName is *.trk then this is a minimap image

	CRBRPluginIntegratorLinkImage()
	{
		m_iImageID = -1;
		m_bShowImage = false;
		m_imagePos.x = m_imagePos.y = 0;
		m_imageSize.cx = m_imageSize.cy = 0;
		m_dwImageFlags = 0;
		ZeroMemory(&m_imageTexture, sizeof(m_imageTexture));
	}

	~CRBRPluginIntegratorLinkImage()
	{
		SAFE_RELEASE(m_imageTexture.pTexture);
	}
};

class CRBRPluginIntegratorLinkText
{
public:
	int   m_textID;
	DWORD m_fontID;
	
	int          m_posX, m_posY;
	std::wstring m_wsText;
	std::string  m_sText;	
	DWORD        m_dwColor;
	DWORD        m_dwDrawOptions;

	CRBRPluginIntegratorLinkText()
	{
		m_textID = -1;
		m_fontID = 0;
		m_dwColor = C_CARSPECTEXT_COLOR;
		m_dwDrawOptions = 0;
		m_posX = m_posY = 0;
	}

	~CRBRPluginIntegratorLinkText()
	{
		// Do nothing
	}
};

class CRBRPluginIntegratorLink
{
public:
	int m_iCustomPluginMenuIdx;			// Index to custom plugin
	bool m_bCustomPluginActive;			// Is the custom plugin active in RBR menu system?
	std::string m_sCustomPluginName;	// Name of the custom plugin (as shown in RBR Plugins menu)

	std::vector<std::unique_ptr<CRBRPluginIntegratorLinkImage>> m_imageList; // Image cache (DX9 textures)
	std::vector<std::unique_ptr<CRBRPluginIntegratorLinkText>> m_textList;   // Text cache

	CRBRPluginIntegratorLink() 
	{ 
		m_iCustomPluginMenuIdx = 0; 
		m_bCustomPluginActive = FALSE;
	}

	~CRBRPluginIntegratorLink()
	{
		m_iCustomPluginMenuIdx = -1;
		m_bCustomPluginActive = FALSE;
		m_imageList.clear();
		m_textList.clear();
	}
};


//------------------------------------------------------------------------------------------------
//
typedef struct {
	int  MapKey;
	std::string StageName;	// len 128
	char Surface;
	int  Length;
	std::string Format;		// 3		RBR / BTB
	int  MapID;
	std::string Folder;		// 128
} RaceStat_Map;
typedef RaceStat_Map* PRaceStat_Map;

typedef struct {
	int  CarKey;
	std::string ModelName;		// Len 128
	std::string FIACategory;	// 128
	std::string Physics;		// 128
	std::string INIFile;		// 128
	std::string Folder;			// 128
	std::string NGPRevision;	// 128
	int NGPVersion;
	int NGPCarID;
} RaceStat_Car;
typedef RaceStat_Car* PRaceStat_Car;


//------------------------------------------------------------------------------------------------
// CNGPCarMenu class. Custom car preview images in RBR and RBRTM "select a car" menus.
//
class CNGPCarMenu : public IPlugin
{
protected:
	std::string m_sPluginTitle;		// Title of the plugin shown in NGPCarMenu menus
	CSimpleIniW* m_pLangIniFile;	// NGPCarMenu language localization file

	int	m_iCarMenuNameLen;			// Max char space reserved for the current car menu name menu items (calculated in CalculateMaxLenCarMenuName method)

	std::wstringstream m_autoLogonSequenceLabel;		// Text label of the latest autoLogon sequene. For example "main/options/plugins/rbr_rx"
	std::deque<std::string> m_autoLogonSequenceSteps;	// Sequence steps of the autologon
